src/Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/ПечатьСервер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Печатные формы. Табличный документ строится программно по ячейкам, без макета.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует товарную накладную по реализациям. Каждая накладная - с новой страницы.
//
// Параметры:
//  МассивДокументов - Массив из ДокументСсылка.РеализацияТоваров - документы для печати.
//
// Возвращаемое значение:
//  ТабличныйДокумент - печатная форма.
//
Функция НакладнаяНаОтпускТоваров(МассивДокументов) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваров_Накладная";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;

	УстановитьШириныКолонок(ТабличныйДокумент);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Ссылка КАК Ссылка,
	|	Реализация.Номер КАК Номер,
	|	Реализация.Дата КАК Дата,
	|	Реализация.Контрагент КАК Контрагент,
	|	Реализация.Контрагент.ИНН КАК ИНН,
	|	Реализация.Склад КАК Склад,
	|	Реализация.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваров КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реализация.МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.Артикул КАК Артикул,
	|	Товары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки";

	Результаты = Запрос.ВыполнитьПакет();
	Шапки = Результаты[0].Выгрузить();
	СтрокиТоваров = Результаты[1].Выгрузить();

	ОтборСтрок = Новый Структура("Ссылка");
	ПерваяНакладная = Истина;
	Для Каждого Шапка Из Шапки Цикл

		Если Не ПерваяНакладная Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПерваяНакладная = Ложь;

		ОтборСтрок.Ссылка = Шапка.Ссылка;
		ВывестиНакладную(ТабличныйДокумент, Шапка, СтрокиТоваров.НайтиСтроки(ОтборСтрок));

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиНакладную(ТабличныйДокумент, Шапка, СтрокиТоваров)

	Ряд = ТабличныйДокумент.ВысотаТаблицы + 1;

	// Заголовок
	Ячейка = ОбъединеннаяОбласть(ТабличныйДокумент, Ряд, 1, 7);
	Ячейка.Текст = СтрШаблон(НСтр("ru = 'Накладная № %1 от %2'"),
		НомерНаПечать(Шапка.Номер), Формат(Шапка.Дата, "ДЛФ=DD"));
	Ячейка.Шрифт = Новый Шрифт(, 14, Истина);
	Ряд = Ряд + 2;

	Покупатель = Строка(Шапка.Контрагент);
	Если ЗначениеЗаполнено(Шапка.ИНН) Тогда
		Покупатель = Покупатель + ", " + НСтр("ru = 'ИНН'") + " " + Шапка.ИНН;
	КонецЕсли;
	ВывестиРеквизит(ТабличныйДокумент, Ряд, НСтр("ru = 'Покупатель:'"), Покупатель);
	Ряд = Ряд + 1;
	ВывестиРеквизит(ТабличныйДокумент, Ряд, НСтр("ru = 'Склад:'"), Строка(Шапка.Склад));
	Ряд = Ряд + 2;

	// Шапка таблицы
	Заголовки = СтрРазделить(НСтр("ru = '№,Артикул,Товар,Ед.,Количество,Цена,Сумма'"), ",");
	Для Колонка = 1 По Заголовки.Количество() Цикл
		Ячейка = ТабличныйДокумент.Область(Ряд, Колонка, Ряд, Колонка);
		Ячейка.Текст = Заголовки[Колонка - 1];
		Ячейка.Шрифт = Новый Шрифт(, 9, Истина);
		Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		Ячейка.ЦветФона = Новый Цвет(242, 242, 242);
	КонецЦикла;
	ОбвестиРяд(ТабличныйДокумент, Ряд);
	Ряд = Ряд + 1;

	// Строки товаров
	НомерПП = 0;
	Для Каждого СтрокаТоваров Из СтрокиТоваров Цикл
		НомерПП = НомерПП + 1;
		Значения = Новый Массив;
		Значения.Добавить(Формат(НомерПП, "ЧГ=0"));
		Значения.Добавить(СтрокаТоваров.Артикул);
		Значения.Добавить(Строка(СтрокаТоваров.Номенклатура));
		Значения.Добавить(Строка(СтрокаТоваров.ЕдиницаИзмерения));
		Значения.Добавить(ОбщегоНазначенияКлиентСервер.ПредставлениеКоличества(СтрокаТоваров.Количество));
		Значения.Добавить(ОбщегоНазначенияКлиентСервер.ПредставлениеСуммы(СтрокаТоваров.Цена));
		Значения.Добавить(ОбщегоНазначенияКлиентСервер.ПредставлениеСуммы(СтрокаТоваров.Сумма));
		Для Колонка = 1 По Значения.Количество() Цикл
			Ячейка = ТабличныйДокумент.Область(Ряд, Колонка, Ряд, Колонка);
			Ячейка.Текст = Значения[Колонка - 1];
			Ячейка.Шрифт = Новый Шрифт(, 9);
			Если Колонка >= 5 Тогда
				Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			КонецЕсли;
		КонецЦикла;
		ОбвестиРяд(ТабличныйДокумент, Ряд);
		Ряд = Ряд + 1;
	КонецЦикла;

	// Итог
	Ячейка = ОбъединеннаяОбласть(ТабличныйДокумент, Ряд, 1, 6);
	Ячейка.Текст = НСтр("ru = 'Итого:'");
	Ячейка.Шрифт = Новый Шрифт(, 10, Истина);
	Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	Ячейка = ТабличныйДокумент.Область(Ряд, 7, Ряд, 7);
	Ячейка.Текст = ОбщегоНазначенияКлиентСервер.ПредставлениеСуммы(Шапка.СуммаДокумента);
	Ячейка.Шрифт = Новый Шрифт(, 10, Истина);
	Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	Ряд = Ряд + 2;

	Ячейка = ОбъединеннаяОбласть(ТабличныйДокумент, Ряд, 1, 7);
	Ячейка.Текст = СтрШаблон(НСтр("ru = 'Всего наименований %1, на сумму %2'"),
		НомерПП, ЧислоПрописью(Шапка.СуммаДокумента, "L=ru_RU",
			"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
	Ячейка.Шрифт = Новый Шрифт(, 9);
	Ряд = Ряд + 3;

	ВывестиРеквизит(ТабличныйДокумент, Ряд, НСтр("ru = 'Отпустил:'"), "____________________");
	ВывестиРеквизит(ТабличныйДокумент, Ряд, НСтр("ru = 'Получил:'"), "____________________", 5);

КонецПроцедуры

Процедура ВывестиРеквизит(ТабличныйДокумент, Ряд, Заголовок, Значение, КолонкаНачала = 1)

	Ячейка = ТабличныйДокумент.Область(Ряд, КолонкаНачала, Ряд, КолонкаНачала);
	Ячейка.Текст = Заголовок;
	Ячейка.Шрифт = Новый Шрифт(, 9, Истина);

	КолонкаКонца = ?(КолонкаНачала = 1, 7, КолонкаНачала + 2);
	Ячейка = ОбъединеннаяОбласть(ТабличныйДокумент, Ряд, КолонкаНачала + 1, КолонкаКонца);
	Ячейка.Текст = Значение;
	Ячейка.Шрифт = Новый Шрифт(, 9);

КонецПроцедуры

Функция ОбъединеннаяОбласть(ТабличныйДокумент, Ряд, КолонкаС, КолонкаПо)

	Область = ТабличныйДокумент.Область(Ряд, КолонкаС, Ряд, КолонкаПо);
	Область.Объединить();
	Возврат Область;

КонецФункции

Процедура ОбвестиРяд(ТабличныйДокумент, Ряд)

	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	Для Колонка = 1 По 7 Цикл
		ТабличныйДокумент.Область(Ряд, Колонка, Ряд, Колонка).Обвести(Линия, Линия, Линия, Линия);
	КонецЦикла;

КонецПроцедуры

Процедура УстановитьШириныКолонок(ТабличныйДокумент)

	Ширины = СтрРазделить("5,14,40,6,12,12,14", ",");
	Для Колонка = 1 По Ширины.Количество() Цикл
		ТабличныйДокумент.Область(, Колонка, , Колонка).ШиринаКолонки = Число(Ширины[Колонка - 1]);
	КонецЦикла;

КонецПроцедуры

// Номер без ведущих нулей: "00000000012" -> "12".
//
// Параметры:
//  Номер - Строка - номер документа.
//
// Возвращаемое значение:
//  Строка - номер для печати.
//
Функция НомерНаПечать(Номер)

	Результат = СокрЛП(Номер);
	Пока СтрДлина(Результат) > 1 И Лев(Результат, 1) = "0" Цикл
		Результат = Сред(Результат, 2);
	КонецЦикла;
	Возврат Результат;

КонецФункции

#КонецОбласти
